src/cf/maERP_ib/src/Documents/СписаниеБезналичныхДенежныхСредств/СписаниеБезналичныхДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеБезналичныхДенежныхСредств</name>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <basedOn>Document.ПоступлениеБезналичныхДенежныхСредств</basedOn>
  <basedOn>Document.ПриходныйКассовыйОрдер</basedOn>
  <basedOn>Document.ПоступлениеДополнительныхРасходов</basedOn>
  <basedOn>Document.ПрочиеРасходы</basedOn>
  <basedOn>Document.НалоговаяНакладнаяПокупка</basedOn>
  <registerRecords>AccumulationRegister.ОплатыЧеками</registerRecords>
  <registerRecords>AccumulationRegister.Убытки</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияПоКассе</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.Зарплата</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателями</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСКонтрагентамиПрочие</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <attributes>
    <name>БанковскийСчёт</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчётКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеречисленияВБюджет</name>
    <type>
      <types>EnumRef.ВидыПеречисленийВБюджет</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияБанком</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПлатежа</name>
    <comment>Поле 22 &quot;Код&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИННПлательщика</name>
    <type>
      <types>DefinedType.NIF</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННПолучателя</name>
    <type>
      <types>DefinedType.NIF</types>
    </type>
  </attributes>
  <attributes>
    <name>КодБК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВидаДохода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВыплат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКТМО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентДенежныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>КПППлательщика</name>
    <type>
      <types>DefinedType.RC</types>
    </type>
  </attributes>
  <attributes>
    <name>КПППолучателя</name>
    <type>
      <types>DefinedType.RC</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОчередностьПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеречислениеВБюджет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательДаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательТипа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроведеноБанком</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСоставителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасчетаЗарплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ВыплатаЗарплаты</types>
      <types>DocumentRef.ПлатёжнаяВедомостьНаАванс</types>
      <types>DocumentRef.ВозвратОтПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Чек</name>
    <type>
      <types>CatalogRef.БанковскиеЧеки</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВВалютеРеглУчета</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧОснования</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ПрочиеРасходы</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ПоступлениеДополнительныхРасходов</types>
        <types>DocumentRef.НалоговаяНакладная</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>НесколькоСтавокНДС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РасшифровкаНДС</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/maERP_ib/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>АвансКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВКассу</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПоОтгрузкамТовара</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеОприходование</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеСписание</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеДенежныхСредствНаБанковскийСчет</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНалоговИВзносов</name>
  </enumValues>
  <enumValues>
    <name>ПланируемыеЦеныЗакупки</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассы</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствСБанковскогоСчета</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПродажаВКредит</name>
  </enumValues>
  <enumValues>
    <name>ПрочееПоступлениеДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ПрочийРасходДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>РазукомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличныхДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЗадолженности</name>
  </enumValues>
  <enumValues>
    <name>УстановкаЦенНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОбналичиваниеЧека</name>
  </enumValues>
  <enumValues>
    <name>ОперационныеЗатраты</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>Инкассация</name>
  </enumValues>
</mdclass:Enum>

src/cf/maERP_ib/src/Documents/СписаниеБезналичныхДенежныхСредств/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Или
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеДополнительныхРасходов") Или
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Или
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Или 
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Или
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НалоговаяНакладнаяПокупка") Тогда
		Организация = ДанныеЗаполнения.Организация;
		ДанныеОрганизации = ОбщегоНазначенияВызовСервера.ПолучитьДанныеОрганизации(Организация);
		БанковскийСчёт = ДанныеОрганизации.БанковскийСчёт;
		Контрагент = ДанныеЗаполнения.Контрагент;
		ДанныеКонтрагента = ОбщегоНазначенияВызовСервера.ПолучитьДанныеКонтрагента(Контрагент, Организация,, ТекущаяДатаСеанса());
		БанковскийСчётКонтрагента = ДанныеКонтрагента.БанковскийСчёт;
		Договор = ДанныеЗаполнения.Договор;
		Документы.СписаниеБезналичныхДенежныхСредств.УстановитьРеквизитыПлательщикаПолучателя(ЭтотОбъект);
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Или 
			ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеДополнительныхРасходов") Или
			ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НалоговаяНакладнаяПокупка") Тогда
			ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику;
			Валюта = ДанныеЗаполнения.Валюта;
		Иначе	
			ХозяйственнаяОперация = ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьСоответствиеПревращенийХозяйственныхОпераций(ДанныеЗаполнения.ХозяйственнаяОперация);			
		КонецЕсли;
		ТипОплаты = Справочники.TypesDePayment.VirementBanquaire;
		Сумма = ДанныеЗаполнения.Сумма;
		РаботаСДокументамиКлиентСервер.ДобавитьОснованиеВДенежныйДокумент(ЭтотОбъект, ДанныеЗаполнения);
		Обработки.КлиентБанк.СформироватьТекстНазначенияПлатежа(ЭтотОбъект);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПрочиеРасходы") Тогда 
		ХозяйственнаяОперация = ДанныеЗаполнения.ХозяйственнаяОперация;
		Организация = ДанныеЗаполнения.Организация;
		Контрагент = ДанныеЗаполнения.Контрагент;
		ДанныеОрганизации = ОбщегоНазначенияВызовСервера.ПолучитьДанныеОрганизации(Организация);
		ТипОплаты = Справочники.TypesDePayment.VirementBanquaire;
		Сумма = ДанныеЗаполнения.Сумма;
		СтатьяДДС = ДанныеЗаполнения.СтатьяДДС;
		РаботаСДокументамиКлиентСервер.ДобавитьОснованиеВДенежныйДокумент(ЭтотОбъект, ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда 
		ДокЗаполнения = ДанныеЗаполнения.Документ;
		ТипОплаты = ?(ДанныеЗаполнения.Свойство("ТипОплаты"), ДанныеЗаполнения.ТипОплаты, Справочники.TypesDePayment.VirementBanquaire);
		Организация = ДокЗаполнения.Организация;
		ДанныеОрганизации = ОбщегоНазначенияВызовСервера.ПолучитьДанныеОрганизации(Организация);
		БанковскийСчёт = ДанныеОрганизации.БанковскийСчёт;
		Контрагент = ДокЗаполнения.Контрагент;
		ДанныеКонтрагента = ОбщегоНазначенияВызовСервера.ПолучитьДанныеКонтрагента(Контрагент, Организация,, ТекущаяДатаСеанса());
		БанковскийСчётКонтрагента = ДанныеКонтрагента.БанковскийСчёт;
		Договор = ДокЗаполнения.Договор;
		Документы.ПоступлениеБезналичныхДенежныхСредств.УстановитьРеквизитыПлательщикаПолучателя(ЭтотОбъект);
		Если ТипЗнч(ДокЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента;
		ИначеЕсли ТипЗнч(ДокЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда	
			ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика;	
			Валюта = ДанныеЗаполнения.Валюта;
		Иначе	
			ХозяйственнаяОперация = ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьСоответствиеПревращенийХозяйственныхОпераций(ДокЗаполнения.ХозяйственнаяОперация);			
		КонецЕсли;
		Сумма = ДанныеЗаполнения.Сумма;
		РаботаСДокументамиКлиентСервер.ДобавитьОснованиеВДенежныйДокумент(ЭтотОбъект, ДокЗаполнения);
		Если Не ТЧОснования.Количество() = 0 Тогда 
			СтрТЧОснования = ТЧОснования.Получить(0);
			СтрТЧОснования.Сумма = Сумма;
			РаботаСДокументамиКлиентСервер.РассчитатьСуммуНДСПлатёжногоДокумента(СтрТЧОснования);
		КонецЕсли;
	Иначе
		ДанныеОрганизации = ОбщегоНазначенияВызовСервера.ПолучитьДанныеОрганизации(Организация);
		МестоХранения = РегистрыСведений.НастройкиПользователей.СкладПользователя();
	КонецЕсли;
	СтатьяДДС = ОбщегоНазначенияВызовСервера.ПолучитьСтатьюДДСПоХозяйственнойОперации(ХозяйственнаяОперация);
	Если Валюта = Константы.ВалютаРегламентированногоУчета.Получить() Тогда 
		СуммаВВалютеРеглУчета = Сумма;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	// Блокировки
	Если ЗначениеЗаполнено(Контрагент) и ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		Блокировка = Новый БлокировкаДанных;
		//УправляемыеБлокировки.ВзаиморасчётыСКонтрагентамиПрочее(Блокировка, Контрагент);
		УправляемыеБлокировки.ВзаиморасчётыСПокупателями(Блокировка, Контрагент);
		УправляемыеБлокировки.ВзаиморасчётыСПоставщиками(Блокировка, Контрагент);
		Блокировка.Заблокировать();
	КонецЕсли;
	// Формируем движения
	РегистрыНакопления.ДенежныеСредстваОрганизаций.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ДвиженияПоКассе.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСКонтрагентамиПрочие.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСПокупателями.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСПоставщиками.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.Убытки.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.Зарплата.СформироватьДвижения(ЭтотОбъект);	
	// Записываем движения
	Движения.Записать();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	НомерВходящегоДокумента = "";
	ДатаВходящегоДокумента = Неопределено;
	ДатаПроведенияБанком = Неопределено;
	ПроведеноБанком = Ложь;
	Ответственный = ПараметрыСеанса.Пользователь;
	КассоваяСмена = Документы.КассоваяСмена.ПустаяСсылка();
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ПеречислениеВБюджет Тогда
		ПроверяемыеРеквизиты.Добавить("КодБК");
		ПроверяемыеРеквизиты.Добавить("КодОКТМО");
		ПроверяемыеРеквизиты.Добавить("ПоказательДаты");
		ПроверяемыеРеквизиты.Добавить("ПоказательНомера");
		ПроверяемыеРеквизиты.Добавить("ПоказательОснования");
		ПроверяемыеРеквизиты.Добавить("ПоказательПериода");
		ПроверяемыеРеквизиты.Добавить("ПоказательТипа");
		ПроверяемыеРеквизиты.Добавить("СтатусСоставителя");
	КонецЕсли;
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты Тогда 
		ПроверяемыеРеквизиты.Добавить("ПериодРасчетаЗарплаты");
	КонецЕсли;
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОбналичиваниеЧека Тогда 
		ПроверяемыеРеквизиты.Добавить("Чек");
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Контрагент"));
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	РаботаСДокументами.МожноРедактироватьДокумент(ЭтотОбъект, Отказ); 
КонецПроцедуры
